#Область ОбработчикиПользовательскогоИнтерфейса
&НаКлиенте
Процедура УдалитьКлетки(Команда)
	Если Вопрос("Очистить справочник Клетки?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		ОчиститьСправочникКлетки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФигуры(Команда)
	Если Вопрос("Очистить справочник Фигуры?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		ОчиститьСправочникФигуры();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлетки(Команда)
	Если Вопрос("Пересоздать клетки?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		СоздатьКлеткиНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФигуры(Команда)
	Если Вопрос("Пересоздать фигуры?", РежимДиалогаВопрос.ДаНетОтмена) = КодВозвратаДиалога.Да Тогда
		СоздатьФигурыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьКлеткиНаСервере()
	НачатьТранзакцию();
	Попытка
		ОчиститьСправочникКлетки();
		Обработки.ГенераторИгровыхОбъектов.СоздатьКлетки();
		Сообщить("Клетки созданы");
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось создать фигуры: %1'"), ОписаниеОшибки());
		Сообщить(ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьФигурыНаСервере()
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клетки.Ссылка КАК Ссылка,
	|	Клетки.Горизонталь КАК Горизонталь,
	|	Клетки.Вертикаль КАК Вертикаль
	|ИЗ
	|	Справочник.Клетки КАК Клетки
	|ГДЕ
	|	НЕ Клетки.ПометкаУдаления";	
	Доска = Запрос.Выполнить().Выгрузить();
	
	ЦветБелый = Перечисления.Цвета.Белый;
	ЦветЧерный = Перечисления.Цвета.Черный;
	ТипПешка = Перечисления.ТипыФигур.Пешка; 
	ТипЛадья = Перечисления.ТипыФигур.Ладья;
	ТипКонь = Перечисления.ТипыФигур.Конь;
	ТипСлон = Перечисления.ТипыФигур.Слон;
	ТипФерзь = Перечисления.ТипыФигур.Ферзь;
	ТипКороль = Перечисления.ТипыФигур.Король;
	
	НачатьТранзакцию();
	Попытка
		ОчиститьСправочникФигуры();
		
		СоздатьФигуру(ТипЛадья, ЦветБелый, 5.0, "A", 1, Доска);
		СоздатьФигуру(ТипЛадья, ЦветБелый, 5.0, "H", 1, Доска);
		СоздатьФигуру(ТипКонь, ЦветБелый, 3.0, "B", 1, Доска);
		СоздатьФигуру(ТипКонь, ЦветБелый, 3.0, "G", 1, Доска);
		СоздатьФигуру(ТипСлон, ЦветБелый, 3.0, "C", 1, Доска);
		СоздатьФигуру(ТипСлон, ЦветБелый, 3.0, "F", 1, Доска);
		СоздатьФигуру(ТипФерзь, ЦветБелый, 10.0, "D", 1, Доска);
		СоздатьФигуру(ТипКороль, ЦветБелый, 0.0, "E", 1, Доска);
		Для Вертикаль = 1 По 8 Цикл
			СоздатьФигуру(ТипПешка, ЦветБелый, 1.0, Механика.ЧисловВСимвол(Вертикаль), 2, Доска);
		КонецЦикла;
		
		СоздатьФигуру(ТипЛадья, ЦветЧерный, 5.0, "A", 8, Доска);
		СоздатьФигуру(ТипЛадья, ЦветЧерный, 5.0, "H", 8, Доска);
		СоздатьФигуру(ТипКонь, ЦветЧерный, 3.0, "B", 8, Доска);
		СоздатьФигуру(ТипКонь, ЦветЧерный, 3.0, "G", 8, Доска);
		СоздатьФигуру(ТипСлон, ЦветЧерный, 3.0, "C", 8, Доска);
		СоздатьФигуру(ТипСлон, ЦветЧерный, 3.0, "F", 8, Доска);
		СоздатьФигуру(ТипФерзь, ЦветЧерный, 10.0, "D", 8, Доска);
		СоздатьФигуру(ТипКороль, ЦветЧерный, 0.0, "E", 8, Доска);
		Для Вертикаль = 1 По 8 Цикл
			СоздатьФигуру(ТипПешка, ЦветЧерный, 1.0, Механика.ЧисловВСимвол(Вертикаль), 7, Доска);
		КонецЦикла;
		Сообщить("Фигуры созданы.");
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();

		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Не удалось создать фигуры: %1'"), ОписаниеОшибки());
		Сообщить(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции
&НаСервере
Процедура ОчиститьСправочникФигуры()
	НазваниеСправочника = Метаданные.НайтиПоТипу(Тип(Справочники.Фигуры)).Имя;
	Попытка	
		Обработки.ГенераторИгровыхОбъектов.ОчиститьСправочник(НазваниеСправочника);	
	Исключение
		ВызватьИсключение ОписаниеОшибки();	
	КонецПопытки;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСправочникКлетки()
	НазваниеСправочника = Метаданные.НайтиПоТипу(Тип(Справочники.Клетки)).Имя;
	Попытка
		Обработки.ГенераторИгровыхОбъектов.ОчиститьСправочник(НазваниеСправочника);
	Исключение
		ВызватьИсключение ОписаниеОшибки();	
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура СоздатьФигуру(Тип, Цвет, Ценность, Вертикаль, Горизонталь, Клетки)
	Попытка
		Обработки.ГенераторИгровыхОбъектов.СоздатьФигуру(Тип, Цвет, Ценность, Вертикаль, Горизонталь, Клетки);	
	Исключение
	     ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры
#КонецОбласти


