Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	//
	Если ТребуемыеПараметры <> Неопределено Тогда		
		УстановленныеПараметры = Новый Структура;
		
		Для Каждого ИмяПараметра ИЗ ТребуемыеПараметры Цикл
			УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры);
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура УстановитьЗначениеПараметраСеанса(ИмяПараметра, УстановленныеПараметры)
	
	Если УстановленныеПараметры.Свойство(ИмяПараметра) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяПараметра = "ТекущийПользователь" Тогда
		УстановкаСеанса.ОпределитьТекущегоПользователя("ТекущийПользователь", УстановленныеПараметры);
	КонецЕсли;

КонецПроцедуры

Процедура ДополнитьСписокУстановленныхПараметров(УстановленныеПараметры, ПараметрыРаздела)
КонецПроцедуры
