
&НаСервере
Функция ТестОпределитьОчередностьНаСервере()
	ОчередьИгрока = Механика.ОпределитьОчередность(ТестПартия);
	Возврат ОчередьИгрока;
КонецФункции

&НаКлиенте
Процедура ТестОпределитьОчередность(Команда)
	Сообщить(ТестОпределитьОчередностьНаСервере());
КонецПроцедуры

&НаСервере
Процедура ТестЭтоДопустимоеПеремещениеНаСервере()
	Сообщить(Механика.ЭтоДопустимоеПеремещение(ТестФигура, ТестИсточник, ТестНазначение));//!!!
КонецПроцедуры

&НаКлиенте
Процедура ТестЭтоДопустимоеПеремещение(Команда)
	ТестЭтоДопустимоеПеремещениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестЭтоПервыйХодНаСервере()
	Сообщить(Механика.ЭтоПервыйХодФигуры(ТестФигура, ТестПартия));
КонецПроцедуры

&НаКлиенте
Процедура ТестЭтоПервыйХод(Команда)
	ТестЭтоПервыйХодНаСервере();
КонецПроцедуры
