
Процедура ОбработкаПроведения(Отказ, Режим)
	Если ФигураНазначение.Тип = Перечисления.ТипыФигур.Король Тогда
		Сообщить("Взятие короля запрещено.");
		Отказ = Истина;
	КонецЕсли;
		
	Движения.СостояниеФигур.Записывать = Истина;
	Движение = Движения.СостояниеФигур.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Фигура = ФигураНазначение;
	Движение.Взята = Истина;
	
	Движения.СостояниеПартии.Записывать = Истина;
	Движение = Движения.СостояниеПартии.Добавить();
	Движение.Период = Дата;
	Движение.Партия = Партия;
	Движение.Клетка = ДокументОснование.КлеткаНазначение;
	Движение.Фигура = Неопределено;
		
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеФигуры") Тогда		
		ФигураНазначение	= Механика.НайтиФигуруПоКлетке(ДанныеЗаполнения.Дата, 
															ДанныеЗаполнения.КлеткаНазначение, 
															ДанныеЗаполнения.Партия);
		Игрок 				= ДанныеЗаполнения.Игрок;
		Партия 				= ДанныеЗаполнения.Партия;
		ФигураИсточник 		= ДанныеЗаполнения.Фигура;
		Дата 				= ТекущаяДата();
		ДокументОснование	= ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры
