
&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	ф=2;
КонецПроцедуры

&НаКлиенте
Процедура РезультатНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	ф=2;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РезультатПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Область)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РезультатОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДубльНаКлиенте(Элемент.ТекущаяОбласть.Расшифровка);
КонецПроцедуры

&НаСервере
Процедура ДубльНаКлиенте(Расшифровка)
	данныеРасш = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	
КонецПроцедуры