	
Процедура ОпределитьТекущегоПользователя(Знач ИмяПараметра, УстановленныеПараметры) Экспорт	
	Если ИмяПараметра <> "ТекущийПользователь" Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьПользователя = Ложь;
	
	ИдентификаторПользователяИБ = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		
	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Пользователи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
		
	Запрос.Параметры.Вставить("ИдентификаторПользователяИБ ", ИдентификаторПользователяИБ);	
	Результат = Запрос.Выполнить();
		
	Если Результат.Пустой() Тогда
			//ПользовательПоКоду = ПроверитьПользователяПоКоду(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
			//Если ПользовательПоКоду <> Неопределено Тогда
			//	ПараметрыСеанса.ТекущийПользователь = ПользовательПоКоду;
			//	ПользовательОбъект = ПользовательПоКоду.ПолучитьОбъект();
			//	ПользовательОбъект.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;
			//	ПользовательОбъект.Записать();
			//Иначе
				СоздатьПользователя = Истина;
				ИмяПользователя			= ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
				ПолноеИмяПользователя	= ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
			//КонецЕсли;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПараметрыСеанса.ТекущийПользователь = Выборка.Ссылка;
	КонецЕсли;

	
	Если СоздатьПользователя Тогда
		СсылкаНового = Справочники.Пользователи.ПолучитьСсылку();
		ПараметрыСеанса.ТекущийПользователь = СсылкаНового;
		
		НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
		НовыйПользователь.Код			= ИмяПользователя;
		НовыйПользователь.Наименование	= ПолноеИмяПользователя;
		НовыйПользователь.ИдентификаторПользователяИБ = ИдентификаторПользователяИБ;
		НовыйПользователь.УстановитьСсылкуНового(СсылкаНового);
		
		Попытка
			НовыйПользователь.Записать();
		Исключение
			ТекстСообщенияОбОшибке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = 'Пользователь: %1 не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
													|%2'"),
													ИмяПользователя, ОписаниеОшибки() );
			ВызватьИсключение ТекстСообщенияОбОшибке;
		КонецПопытки;
		
		//УстановитьНастройкиПоУмолчанию(НовыйПользователь.Ссылка);
		
	КонецЕсли;	
	
	УстановленныеПараметры.Вставить(ИмяПараметра);
	
КонецПроцедуры